Autodesk.Revit.DB.BuiltInFailures.WallFailures.WallTypeIncompatibleWithTapered
This wall's type is not compatible with the Tapered cross-section. Tapered walls require a variable thickness layer.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.TaperedWallAnglesControlledByType
Cannot set angles on a tapered wall which has angles controlled by the type.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.SubwallOfStackedWallDeleted
This stacked wall will be deleted because a subwall could not be created.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.ExtrudedWallDisallowedForCrossSectionType
Edited profiles are not allowed for this wall's cross-section type.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.DisallowedPathCurve
Cannot create stacked elliptical wall with offsets.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.CurtainOrStackedWallDisallowedForCrossSectionType
Curtain wall types and Stacked wall types are not allowed for this wall's cross-section type.

Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotSlantStackedWallError
Cannot slant a stacked wall with rectangular openings.  Please delete the openings first.